Revit 2020 API
AdvancedWood.WoodPoreType Property
 The property labeled "Pore type" from the "PrismWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static string WoodPoreType { get; }
Visual Basic
Public Shared ReadOnly Property WoodPoreType As String
	Get
Visual C++
public:
static property String^ WoodPoreType {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WoodPoreType".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace